week_4/quiz_polynomial_time.tex
% Created 2024-06-28 Fri 03:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,left=1cm,right=1cm,top=1cm,bottom=1cm]{geometry}
\usepackage[american, english]{babel}
\usepackage{enumitem}
\usepackage{float}
\usepackage[sc]{mathpazo}
\linespread{1.05}
\renewcommand{\labelitemi}{$\rhd$}
\setlength\parindent{0pt}
\setlist[itemize]{leftmargin=*}
\setlist{nosep}
\newcommand{\opt}{\mathrm{OPT}}
\author{Marcio Woitek}
\date{}
\title{Fully Polynomial Time Approximation Scheme}
\hypersetup{
 pdfauthor={Marcio Woitek},
 pdftitle={Fully Polynomial Time Approximation Scheme},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.8)}, 
 pdflang={English}}
\begin{document}

\maketitle
\thispagestyle{empty}
\pagestyle{empty}
\section*{Problem 1}
\label{sec:orgbf06dd6}
\textbf{Answer:} \(100\:n^2\)\\

We begin by computing the value of \(\varepsilon\):
\begin{align}
  \begin{split}
    (1-\varepsilon)\:\opt&=0.9\:\opt\\
    \opt-\varepsilon\:\opt&=0.9\:\opt\\
    \opt-0.9\:\opt&=\varepsilon\:\opt\\
    0.1\:\opt&=\varepsilon\:\opt\\
    0.1&=\varepsilon\\
    \varepsilon&=0.1\\
    \varepsilon&=\frac{1}{10}
  \end{split}
\end{align}
Next, we use this result to evaluate the time cost:
\begin{equation}
n^2\left(\frac{1}{\varepsilon}\right)^2=n^2\cdot 10^2=100\:n^2.
\end{equation}
\section*{Problem 2}
\label{sec:orgbb904ce}
\textbf{Answer:} \(\max\{v|0\leq v\leq 5\:\mathrm{and}\:W(4,v)\leq 6\}\)
\section*{Problem 3}
\label{sec:org084b2e7}
\textbf{Answer:}
\begin{itemize}
\item \(W(0,0)=0\)
\item \(W(1,1)=2\)
\item \(W(1,1)=\min(W(0,1),W(1,0)+2)\)\\
\end{itemize}

Two of the options are easy to check. We were given the equation \(W(0,0)=0\).
Then the corresponding option is \textbf{correct}. The expression for \(W(0,1)\) is
also simple to evaluate. After all, we were given the equation for \(W(0,v)\).
Since this value is infinity for \(v>0\), the option involving \(W(0,1)\) is
\textbf{wrong}.\\
To make a decision on the remaining options, we need to compute the value of
\(W(1,1)\). This can be done as follows:
\begin{align}
  \begin{split}
    W(1,1)&=\min(W(1-1,1),W(1-1,1-v_1)+w_1)\\
    &=\min(W(0,1),W(0,1-1)+2)\\
    &=\min(W(0,1),W(0,0)+2)\\
    &=\min(W(0,1),0+2)\\
    &=\min(\infty,2)\\
    &=2
  \end{split}
\end{align}
Therefore, the option containing a value is \textbf{correct}. The other option is also
\textbf{right}, since \(W(0,0)=W(1,0)=0\). This allows us to write
\begin{equation}
\min(W(0,1),W(1,0)+2)=\min(W(0,1),W(0,0)+2)=W(1,1).
\end{equation}
\end{document}
